app/controllers/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 2) LIMIT 1

  def edit
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 3) LIMIT 1

  def create
    @member = Member.new(params[:member])

    if @member.save
---
INSERT INTO "members" ("created_at", "mentor", "name", "biography", "subteam", "updated_at", "graduating_year") VALUES ('2011-02-12 02:46:44.059388', 'f', 'Alex Kern', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', 'Programming', '2011-02-12 02:46:44.059388', 2012)

  def update
    @member = Member.find(params[:id])

    if @member.update_attributes(params[:member])
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 3) LIMIT 1
UPDATE "members" SET "picture_url" = 'http://t1.gstatic.com/images?q=tbn:ANd9GcR4_KARs-g_5f0HqoueuTi9bAfjy8wQIiuSnebaa3avwy_oFv89kw&t=1', "updated_at" = '2011-02-12 03:13:28.205774' WHERE ("members"."id" = 3)

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 2) LIMIT 1
DELETE FROM "members" WHERE ("members"."id" = 2)